In [3]:
import numpy as np
import pandas as pd

# 多层Series

In [78]:
data = pd.Series([100,200,122,150,180],
                 index = [
                     ['2016','2016','2016','2017','2017'],
                     ['苹果','香蕉','西瓜','苹果','西瓜']   #双层index
                 ])
data

2016  苹果    100
      香蕉    200
      西瓜    122
2017  苹果    150
      西瓜    180
dtype: int64

In [79]:
data['2016']   #对于第一列index，和普通方法一样，直接索引

苹果    100
香蕉    200
西瓜    122
dtype: int64

In [80]:
# data['苹果']  # 对于多层index数据，使用第n列index值时，必须保证[ ，, ...]结构，即花式索引结构，以索引后续列之前的列index值
print(data['2016','苹果'])
print()
print(data[:,'苹果'])

100

2016    100
2017    150
dtype: int64

—— ﹡.swaplevel() 重排分级顺序

—— ﹡.swaplevel().sort_index() 交换分层索引

In [81]:
data01 = data.swaplevel().sort_index()
data01

苹果  2016    100
    2017    150
西瓜  2016    122
    2017    180
香蕉  2016    200
dtype: int64

—— unstack(level = ) 删除level列index

—— stack(level = ) 将level行columns转换为index

转变为DataFrame 索引的堆

In [83]:
data02 = data.unstack(level = 0 )   #level=0，删除第0列的index
data02

     2016   2017
苹果  100.0  150.0
西瓜  122.0  180.0
香蕉  200.0    NaN

In [63]:
data02 = data02.stack(level = 0)
print(data02)
print()
print(data02.swaplevel().sort_index())

苹果  2016    100.0
    2017    150.0
西瓜  2016    122.0
    2017    180.0
香蕉  2016    200.0
dtype: float64

2016  苹果    100.0
      西瓜    122.0
      香蕉    200.0
2017  苹果    150.0
      西瓜    180.0
dtype: float64

# DataFrame层次索引

—— *.set_index([]) 将指定列设置为index

In [4]:
df = pd.DataFrame({
    'year':[2010,2010,2012,2012,2013],
    'fruit':['apple','banana','apple','banana','apple'],
    'production':[2345,3214,5663,2341,3523],
    'profits':[233.44,355.23,566.45,678.56,755.89]
})
df

    fruit  production  profits  year
0   apple        2345   233.44  2010
1  banana        3214   355.23  2010
2   apple        5663   566.45  2012
3  banana        2341   678.56  2012
4   apple        3523   755.89  2013

In [5]:
df = df.set_index(['year','fruit'])   # 此时会自动删除系统默认提供的index(行索引)
df   # 这里的year和fruit不是columns，而是index的header

             production  profits
year fruit
2010 apple         2345   233.44
     banana        3214   355.23
2012 apple         5663   566.45
     banana        2341   678.56
2013 apple         3523   755.89

In [6]:
print(df.loc[2010,'apple'])   #行索引
print()
print(df.loc[2010,'apple']['production'])   # 非花式索引

production    2345.00
profits        233.44
Name: (2010, apple), dtype: float64

2345.0

In [17]:
df.mean(level = 'fruit')   # 由于DataFrame中的index有header，所以可以用level = header 来获取相应index列

         production     profits
fruit
apple   3843.666667  518.593333
banana  2777.500000  516.895000